# EXL_GetSheetName

## Description
Get name of Excel sheets.

```pascal
FUNCTION EXL_GetSheetName(
				sheetIndex       : INTEGER;
				VAR outSheetName : STRING) : BOOLEAN;
```

```python

def vs.EXL_GetSheetName(sheetIndex):
    return (BOOLEAN, outSheetName)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|sheetIndex|INTEGER||
|outSheetName|STRING||

## Version
Availability: from Vectorworks 2021
## Category
* Excel